/*
小南毕业工作了，他想知道自己每年的扣税情况。他查到的综合所得的个人所得税税率表如下：
级数
全年应纳税所得额
税率（%）
速算扣除数
1
不超过36000元的部分
3
0
2
超过36000-144000元的部分
10
2520
3
超过144000-300000元的部分
20
16920
4
超过300000-420000元的部分
25
31920
5
超过420000-660000元的部分
30
52920
6
超过660000-960000元的部分
35
85920
7
超过960000元的部分
45
181920
你能根据小南的收入算出他每年所要缴纳的税款吗？
输入
多个样例。每个样例输入一个整数m(104≤m≤107)代表小南的年终收入，为100的整数倍。
输出
每个样例输出一个整数，表示小南缴纳的个税。每个样例输出结果占一行。
*/


#include <stdio.h>

int main(){
	long long n,i,res;
	while (scanf("%lld",&n)!=EOF){
        if (n<36000) res=n*0.03;
        else if (n<144000) res=36000*0.03+(n-36000)*0.1;
        else if (n<300000) res=36000*0.03+(144000-36000)*0.1+(n-144000)*0.2;
        else if (n<420000) res=36000*0.03+(144000-36000)*0.1+(300000-144000)*0.2+(n-300000)*0.25;              
        else if (n<660000) res=36000*0.03+(144000-36000)*0.1+(300000-144000)*0.2+(420000-300000)*0.25+(n-420000)*0.3; 
        else if (n<960000) res=36000*0.03+(144000-36000)*0.1+(300000-144000)*0.2+(420000-300000)*0.25+(660000-420000)*0.3+(n-660000)*0.35;
        else               res=36000*0.03+(144000-36000)*0.1+(300000-144000)*0.2+(420000-300000)*0.25+(660000-420000)*0.3+(960000-660000)*0.35+(n-960000)*0.45;
        printf("%lld\n",res);
	}
	return 0;
}
